posts-html/post-series.html
<head>
<meta name="viewport" content="width=device-width, initial-scale=1">
<script src="../jquery-3.6.0.min.js"></script>
<meta name="date" content="nil">
<meta name="tags" content="">
<link rel="stylesheet" href="../css/site.css">
</head>
<div class="header col-12 test"><a href="../index.html"><h1 class="center">Devo_Overflow</h1><div class="triple-line"><hr style="margin-left:40%; margin-right:40%;"><hr style="margin-left:45%; margin-right:45%;"><hr style="margin-left:48%; margin-right:48%;"></div></a></div><div class="col-3 side disappear"></div><div class="col-6 test article content center"><h1 class="center" id="title">Post Series</h1<meta name="date" content="2022-06-26">
<h5 id="date">26 Jun 2022</h5>
<div id="outline-container-org3b490d5" class="outline-2">
<h2 id="20220602191239">Thought for the day</h2>
<div class="outline-text-2" id="text-20220602191239">
<p>
Short reflections.
</p>
<ul class="org-ul">
<li><a href="20220623212643.html">Not as the world gives</a></li>
</ul>
</div>
</div>

<div id="outline-container-org11558ca" class="outline-2">
<h2 id="20220602142630">Mining for Wisdom: Gems from Solomon's Quarry</h2>
<div class="outline-text-2" id="text-20220602142630">
<p>
Some wisdom from the books of Proverbs and Ecclesiastes.
</p>

<ul class="org-ul">
<li><a href="20220527172601.html">If Your Strong City Is Not God</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf802147" class="outline-2">
<h2 id="20220602191220">Teach Like A Christian</h2>
<div class="outline-text-2" id="text-20220602191220">
<p>
A series of posts on Teaching as a Christian. Some reflections on how to apply Scripture to the teaching profession and also what teaching has taught me.
</p>
</div>
</div>

<div id="outline-container-org1463c3b" class="outline-2">
<h2 id="20220602191235">Who do you say that I am?</h2>
<div class="outline-text-2" id="text-20220602191235">
<p>
During Jesus life on earth many people had all kinds of ideas about who He was. On one occasion Jesus asks the disciples what people were saying about Him. After fielding some responses a Jesus asks the disciples "But who do you say that I am?". And this is a question we must all answer, and will all answer one way or the other. These posts are what the bible has to say about who Jesus. OF course they will be wholy inadequate, but hopefully, they will be helpful.
</p>
</div>
</div>
<hr><div id="blogTags" class="blogTags"></div><script>let tagArr = $('meta[name="tags"]').attr("content").split(" ");let tagString = "";$.each(tagArr, function(i, tag) {
		  tagString = tagString + "<a href=\"../tags.html#"+tag+"\"> #"  + tag + "</a>"});$('#blogTags').append(tagString);</script></div><div class="footer" style="test"></div>
